project-01/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4 //patchの数
(
    fixedWalls
    {
        type            wall;
        nFaces          40;
        startFace       760;
    }
    inlet //patchの名前
    {
        type            patch; //patchのtype
        nFaces          20; //patchを構成する面の数
        startFace       800; //面のリストにおけるpatchが始まる面番号
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       820;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          800;
        startFace       840;
    }
)

// ************************************************************************* //
