project-01/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;//離散化スキームの設定＝各微分演算子等の項目に対して、それに関する方程式の項について離散化スキームを設定。
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes//時間微分の離散化スキームを指定
{
    default         Euler;
}

gradSchemes//勾配の離散化スキーム。セルの界面の保管スキーム。
{
    default         Gauss linear;
    grad(p)         Gauss linear;
}

divSchemes//発散の離散化スキーム。”div(phi,U)”は対流項。
{
    default         none;
    div(phi,U)      Gauss linear;
}

laplacianSchemes//ラプラシアンの離散化スキーム。
{
    default         Gauss linear orthogonal;//orthogonalは「補正なし」という意味。
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal;
}


// ************************************************************************* //
